Торговля_11__демо/src/DataProcessors/ПредпросмотрЧека/ПредпросмотрЧека.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПредпросмотрЧека</name>
</mdclass:DataProcessor>

Торговля_11__демо/src/Enums/ТипыОбъектовРасчетов/ТипыОбъектовРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовРасчетов</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>Накладная</name>
  </enumValues>
  <enumValues>
    <name>ПлатежВозврат</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Documents/ВзаимозачетЗадолженности/ВзаимозачетЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВзаимозачетЗадолженности</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютахУчета</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентКонтрагент</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДебитор</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентКредитор</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВзаимозачетаЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияКредитор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДебитора</name>
    <type>
      <types>EnumRef.ТипыУчастниковВзаимозачета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКредитора</name>
    <type>
      <types>EnumRef.ТипыУчастниковВзаимозачета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбъектРасчетовИнтеркампани</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовИнтеркампани</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовИнтеркампаниЗеркальный</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовДебиторКредитор</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовДебиторКредиторЗеркальный</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДебиторскаяЗадолженность</name>
    <attributes>
      <name>ТипРасчетов</name>
      <type>
        <types>EnumRef.ТипыРасчетовСПартнерами</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьЗаказ</name>
      <type>
        <types>DefinedType.ОбъектРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетовЗеркальный</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КредиторскаяЗадолженность</name>
    <attributes>
      <name>ТипРасчетов</name>
      <type>
        <types>EnumRef.ТипыРасчетовСПартнерами</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьЗаказ</name>
      <type>
        <types>DefinedType.ОбъектРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетовЗеркальный</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Торговля_11__демо/src/DataProcessors/ПредпросмотрЧека/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ПараметрыОперации")
		ИЛИ НЕ Параметры.ПараметрыОперации.Свойство("ДокументСсылка") Тогда
		
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяФорма = "Форма";
	
	Параметры.Вставить(
		"ПодключенноеОборудованиеПечатиЧеков",
		ФормированиеФискальныхЧековСервер.ПодключенноеОборудованиеПечатиЧеков(Параметры.ПараметрыОперации));
	
	Если НЕ ВалютаДокументаВалютаРеглУчета(Параметры.ПараметрыОперации) Тогда
		ВыбраннаяФорма = "ОшибкаИспользуемойВалюты";
	ИначеЕсли НЕ ПодключенноеОборудованиеНастроено(Параметры.ПодключенноеОборудованиеПечатиЧеков) Тогда
		ВыбраннаяФорма = "ОшибкаПодключенияККТ";
	Иначе
		ФормированиеФискальныхЧековСервер.ОбработкаПолученияФормыПредпросмотрЧека(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВалютаДокументаВалютаРеглУчета(ОсновыеПараметрыОперации)
	
	ВалютаДокументаВалютаРеглУчета = Истина;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
		ВалютаРегл = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ОсновыеПараметрыОперации.ДокументСсылка.Организация);

		Если ТипЗнч(ОсновыеПараметрыОперации.ДокументСсылка) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
						   |	""Дт"" КАК Сторона,
			               |	ДебиторскаяЗадолженность.ОбъектРасчетов КАК ОбъектРасчетов,
			               |	ДебиторскаяЗадолженность.ОбъектРасчетов.Валюта КАК Валюта
			               |ИЗ
			               |	Документ.ВзаимозачетЗадолженности.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженность
			               |ГДЕ
			               |	ДебиторскаяЗадолженность.Ссылка = &ДокументСсылка
			               |	И НЕ ДебиторскаяЗадолженность.ОбъектРасчетов.ТипОбъектаРасчетов В (ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Заказ), ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Договор))
			               |	И ДебиторскаяЗадолженность.ОбъектРасчетов.Валюта <> &ВалютаРегламентированногоУчета
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
						   |	""Кт"" КАК Сторона,
			               |	КредиторскаяЗадолженность.ОбъектРасчетов,
			               |	КредиторскаяЗадолженность.ОбъектРасчетов.Валюта
			               |ИЗ
			               |	Документ.ВзаимозачетЗадолженности.КредиторскаяЗадолженность КАК КредиторскаяЗадолженность
			               |ГДЕ
			               |	КредиторскаяЗадолженность.Ссылка = &ДокументСсылка
			               |	И НЕ КредиторскаяЗадолженность.ОбъектРасчетов.ТипОбъектаРасчетов В (ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Заказ), ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Договор))
			               |	И КредиторскаяЗадолженность.ОбъектРасчетов.Валюта <> &ВалютаРегламентированногоУчета";
			
			Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегл);
			Запрос.УстановитьПараметр("ДокументСсылка", ОсновыеПараметрыОперации.ДокументСсылка);
			Результат = Запрос.Выполнить();
			Если Не Результат.Пустой() Тогда
				ВалютаДокументаВалютаРеглУчета = Ложь;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ОсновыеПараметрыОперации.Валюта)
			И ЗначениеЗаполнено(ОсновыеПараметрыОперации.ВалютаВзаиморасчетов) Тогда

			Если ОсновыеПараметрыОперации.Валюта <> ВалютаРегл
				ИЛИ ОсновыеПараметрыОперации.ВалютаВзаиморасчетов <> ВалютаРегл Тогда

				ВалютаДокументаВалютаРеглУчета = Ложь;
			КонецЕсли;

		ИначеЕсли ЗначениеЗаполнено(ОсновыеПараметрыОперации.Валюта) Тогда

			Если ОсновыеПараметрыОперации.Валюта <> ВалютаРегл Тогда
				ВалютаДокументаВалютаРеглУчета = Ложь;
			КонецЕсли;

		Иначе

			ВалютаДокументаВалютаРеглУчета = Ложь;

		КонецЕсли;
	
	#КонецЕсли
	
	Возврат ВалютаДокументаВалютаРеглУчета;
	
КонецФункции

Функция ПодключенноеОборудованиеНастроено(ПодключенноеОборудованиеПечатиЧеков)
	
	Возврат ПодключенноеОборудованиеПечатиЧеков.Количество() > 0;
	
КонецФункции

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СогласиеНаОбработкуПерсональныхДанных") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СогласиеНаОбработкуПерсональныхДанных",
			НСтр("ru = 'Согласие на обработку персональных данных'"),
			СформироватьПечатнуюФормуСогласиеНаОбработкуПерсональныхДанных(МассивОбъектов, ПараметрыПечати, ПараметрыПечати),
			,
			"Обработка.ПредпросмотрЧека.СогласиеНаОбработкуПерсональныхДанных");
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуСогласиеНаОбработкуПерсональныхДанных(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПредпросмотрЧека.ПФ_MXL_СогласиеНаОбработкуПерсональныхДанных");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПредпросмотрЧека_СогласиеНаОбработкуПерсональныхДанных";
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ОписаниеСогласия");
	ТабличныйДокумент.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПостояннаяЧастьПерсональныхДанных");
	ТабличныйДокумент.Вывести(Область);
	
	Если ПараметрыПечати.ТипПерсональныхДанных = "ИНН" Тогда
		Область = Макет.ПолучитьОбласть("ПерсональныеДанныеИНН");
		ТабличныйДокумент.Вывести(Область);
	Иначе
		Область = Макет.ПолучитьОбласть("ПерсональныеДанныеПаспортныеДанные");
		ТабличныйДокумент.Вывести(Область);
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(Область);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
